# Основы pandas

In [5]:
import numpy as np

In [6]:
import pandas as pd

Пример забора данных с сайтов

In [3]:
pd.read_clipboard(sep='\t')

   a   b
0   1  3
1   2  4

In [ ]:
pd.read_

In [5]:
pd.read_html('http://www.cbr.ru')[0]

  Курсы валют с 30.07.2020 с 31.07.2020
0  Доллар США     72,2348₽     73,3633₽
1        Евро     84,9120₽     86,2532₽

In [7]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [9]:
df[:5][1]

       Имя  Unnamed: 1      %    курс                 Дата
0  EUR/RUB         NaN   6775   87453  31.07.2020 22:42:00
1  USD/RUB         NaN  13492    7439  01.08.2020 00:14:00
2  CHF/RUB         NaN    219  814519  01.08.2020 06:11:00
3  JPY/RUB         NaN      1    7029  01.08.2020 06:11:00
4  GBP/RUB         NaN      0  973244  01.08.2020 06:11:00
5  NOK/RUB         NaN    536   81765  01.08.2020 06:11:00
6  AUD/RUB         NaN    -98  531018  01.08.2020 06:11:00
7  NZD/RUB         NaN      0  493429  01.08.2020 06:11:00
8  TRY/RUB         NaN    -57  106691  01.08.2020 06:11:00

In [ ]:
import pymysql

In [ ]:
pd.read_excel('file.xlsx', sheet_name='...')

In [ ]:
pd.read_sql('select * from db.table;', connection)

Импорт данных из файла

In [ ]:
pd.display_columns = None

In [12]:
data = pd.read_csv('power.csv')
data.head(100)

        country  year  quantity  category
0       Austria  1996       5.0         1
1       Austria  1995      17.0         1
2       Belgium  2014       0.0         1
3       Belgium  2013       0.0         1
4       Belgium  2012      35.0         1
..          ...   ...       ...       ...
95  Netherlands  2005     212.0         1
96  Netherlands  2004     186.0         1
97  Netherlands  2003     372.0         1
98  Netherlands  2002     234.0         1
99  Netherlands  2001     321.0         1

[100 rows x 4 columns]

In [13]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [14]:
type(data)

pandas.core.frame.DataFrame

In [16]:
data.head(10).to_excel('text.xlsx', index=False)

In [17]:
data.loc[10:20]

    country  year  quantity  category
10  Finland  2010       9.0         1
11  Finland  2009      13.0         1
12  Finland  2008      39.0         1
13  Finland  2007      21.0         1
14  Finland  2006       0.0         1
15  Finland  2005       0.0         1
16  Finland  2004       0.0         1
17  Finland  2003       0.0         1
18  Finland  2002       0.0         1
19  Finland  2001       0.0         1
20  Finland  2000       0.0         1

In [19]:
pd.read_csv('power.csv', sep=',').head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
garbage collector

In [21]:
data = pd.DataFrame({})

          country  year  quantity  category
0         Austria  1996       5.0         1
1         Austria  1995      17.0         1
2         Belgium  2014       0.0         1
3         Belgium  2013       0.0         1
4         Belgium  2012      35.0         1
...           ...   ...       ...       ...
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

[1189482 rows x 4 columns]

In [20]:
?pd.read_csv

In [24]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [23]:
# количество строк в датафрейме

len(data)

1189482

In [25]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [26]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [28]:
trans = pd.read_csv('transactions.csv') 
trans.shape

(60, 8)

In [36]:
type(trans)

pandas.core.frame.DataFrame

In [32]:
trans.tail()

    Year  Month    ID Product  Amount  Price  Total  Cost
55  2017     12  t056      _4       2   8618  17236  1200
56  2017     12  t057      _2       8   1896  15168  1200
57  2017     12  t058      _5       2   5175  10350   200
58  2017     12  t059      _8       3   3760  11280   800
59  2017     12  t060      _3       4   1265   5060   700

In [34]:
pd.read_csv('transactions.csv').tail(20).shape

(20, 8)

In [30]:
df = pd.read_csv('transactions.csv') 
len(df) 
df.shape

(60, 8)

In [31]:
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

In [ ]:
data = pd.read_csv('transactions.csv')
data.shape

### Основные сведения о датафрейме

In [ ]:
.apply()

In [40]:
type(data)

pandas.core.frame.DataFrame

In [41]:
data.head(10).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
country          10 non-null object
year             10 non-null int64
quantity         10 non-null float64
category         10 non-null int64
year_plus_one    10 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 528.0+ bytes

In [39]:
2**64

18446744073709551616

In [42]:
# немного статистики

data.describe()

               year      quantity      category  year_plus_one
count  1.189482e+06  1.189482e+06  1.189482e+06   1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01   2.003852e+03
std    7.167345e+00  1.585663e+07  1.809968e+01   7.167345e+00
min    1.990000e+03 -8.643480e+05  1.000000e+00   1.991000e+03
25%    1.997000e+03  1.400000e+01  2.400000e+01   1.998000e+03
50%    2.003000e+03  1.890000e+02  3.500000e+01   2.004000e+03
75%    2.009000e+03  2.265000e+03  5.100000e+01   2.010000e+03
max    2.014000e+03  6.680329e+09  7.100000e+01   2.015000e+03

In [46]:
pd.DataFrame({'value': [1, 2, 3, 4, 5]}).describe()

          value
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

### Отдельный столбец (тип Series)

In [43]:
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

In [47]:
data['year of data'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [58]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [48]:
type(data['year'])

pandas.core.series.Series

In [49]:
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

In [50]:
# уникальные значения в столбце

data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71])

In [52]:
len(data['category'].unique())

71

In [53]:
data['category'].nunique()

71

In [54]:
len(data)

1189482

In [57]:
data.duplicated().sum()

424876

In [59]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [60]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [61]:
data['category'].value_counts(normalize=True).head()

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

# Фильтры

In [62]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [63]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [64]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [66]:
data[['country']].head()

   country
0  Austria
1  Austria
2  Belgium
3  Belgium
4  Belgium

### Отфильтруем строки с потреблением выше среднего

In [67]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [68]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [69]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [71]:
f'quantity > {average_level}'

'quantity > 184264.77005012965'

In [72]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query(f'quantity > {average_level}').head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [ ]:
if ... > ...:

In [73]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [74]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [ ]:
if 'Rus' in country:
    ...

In [ ]:
if 'ru' in 'Russia', 'Belarus'

In [75]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [76]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [ ]:
.between(1, 10)

In [77]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [78]:
# фильтры на номер строки

data.loc[1000:1005]

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка

In [79]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [80]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [81]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(50)

             country  year      quantity  category
835127   Afghanistan  2014  1.935442e+06        42
491541   Afghanistan  2014  6.600000e+04        31
492004   Afghanistan  2014  6.600000e+04        31
492292   Afghanistan  2014  6.600000e+04        31
791301   Afghanistan  2014  5.537080e+03        42
797879   Afghanistan  2014  5.537080e+03        42
811493   Afghanistan  2014  5.537080e+03        42
813883   Afghanistan  2014  5.537080e+03        42
820564   Afghanistan  2014  5.537080e+03        42
828390   Afghanistan  2014  5.537080e+03        42
832393   Afghanistan  2014  5.537080e+03        42
1097271  Afghanistan  2014  4.486800e+03        67
1091772  Afghanistan  2014  3.767300e+03        67
1108326  Afghanistan  2014  3.710800e+03        67
1061021  Afghanistan  2014  2.967300e+03        67
1045322  Afghanistan  2014  2.204900e+03        67
364480   Afghanistan  2014  1.758409e+03        25
369505   Afghanistan  2014  1.758396e+03        25
518535   Afghanistan  2014  1.517400e+03        31
521820   Afghanistan  2014  1.517400e+03        31
496034   Afghanistan  2014  1.388700e+03        31
502008   Afghanistan  2014  1.388700e+03        31
509843   Afghanistan  2014  1.388700e+03        31
512335   Afghanistan  2014  1.388700e+03        31
1102803  Afghanistan  2014  1.049300e+03        67
334666   Afghanistan  2014  1.002966e+03        25
341782   Afghanistan  2014  1.002966e+03        25
353105   Afghanistan  2014  1.002966e+03        25
357841   Afghanistan  2014  1.002966e+03        25
563371   Afghanistan  2014  8.953000e+02        33
407563   Afghanistan  2014  8.821000e+02        27
419783   Afghanistan  2014  8.821000e+02        27
432306   Afghanistan  2014  8.821000e+02        27
437547   Afghanistan  2014  8.821000e+02        27
442787   Afghanistan  2014  8.821000e+02        27
462537   Afghanistan  2014  8.821000e+02        27
1053124  Afghanistan  2014  8.000000e+02        67
1066512  Afghanistan  2014  8.000000e+02        67
1116171  Afghanistan  2014  7.760000e+02        67
374415   Afghanistan  2014  7.554300e+02        25
378276   Afghanistan  2014  7.554300e+02        25
1137168  Afghanistan  2014  7.423000e+02        67
713410   Afghanistan  2014  7.130000e+02        39
719887   Afghanistan  2014  7.130000e+02        39
727865   Afghanistan  2014  7.130000e+02        39
733131   Afghanistan  2014  7.130000e+02        39
738397   Afghanistan  2014  7.130000e+02        39
753073   Afghanistan  2014  7.130000e+02        39
1161790  Afghanistan  2014  5.933000e+02        67
1111003  Afghanistan  2014  5.000000e+02        67

### Параметр inplace

In [85]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [87]:
data = data.sort_values('country', ascending=True)

            country  year  quantity  category
585886  Afghanistan  2009    93.000        35
126104  Afghanistan  2007   102.639        14
126105  Afghanistan  2006    99.572        14
126106  Afghanistan  2005    96.598        14
126107  Afghanistan  2004    93.211        14

In [ ]:
def calc(rewrite=True):
    data = data.sort_values('country', ascending=True, inplace=rewrite)

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?